# LoadedApplications Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..LoadedApplications Property
UIApplication Class See Also
---
Returns an array of successfully loaded external applications.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ExternalApplicationArray LoadedApplications { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property LoadedApplications As ExternalApplicationArray
	Get
```

Visual C++
---
```text
public:
virtual property ExternalApplicationArray^ LoadedApplications {
	ExternalApplicationArray^ get ();
}
```

# Remarks
This property can be used by your application to find all successfully loaded external applications when Revit starts.
# See Also
UIApplication Class
Autodesk.Revit.UI Namespace